{
   "posts":[
      {
         "id":1,
         "title":"Exploring the Majestic Mountains: A Journey through the Breathtaking Peaks and Valleys",
         "subtitle":"Adventure in the Alps: Embark on an unforgettable journey as you traverse the stunning landscapes of the Alps. From snow-capped peaks to lush valleys",
         "description":"A thrilling journey through the snow-capped peaks of the Alps. This adventure offers a unique opportunity to immerse yourself in the majestic beauty of the mountains. From the moment you set foot on the trails",
         "date":"2023-07-01T00:00:00Z",
         "image":"https://picsum.photos/id/1/200/300",
         "caption":"Snowy mountains",
         "price":55,
         "status":"onOffer",
         "author":1
      },
      {
         "id":2,
         "title":"Cooking with Fire: Mastering the Art of BBQ for Delicious Grilled Delights",
         "subtitle":"BBQ Techniques: Discover the secrets to perfect barbecue cooking with this comprehensive guide. Learn about different grilling methods, flavoring techniques",
         "description":"Learn how to master the art of barbecue cooking. This guide provides a step-by-step approach to becoming a barbecue pro, from understanding different types of grills and smokers to mastering the art of creating mouthwatering marinades and rubs.",
         "date":"2023-07-05T00:00:00Z",
         "image":"https://picsum.photos/id/2/200/300",
         "caption":"BBQ grill",
         "price":70,
         "status":"onSale",
         "author":2
      },
      {
         "id":3,
         "title":"Underwater Exploration: Dive into the Mysterious World Beneath the Waves",
         "subtitle":"Scuba Diving: Discover the breathtaking beauty of underwater ecosystems as you embark on a scuba diving adventure. Explore vibrant coral reefs, encounter fascinating marine life",
         "description":"Discover the beauty of underwater ecosystems. Scuba diving offers a unique opportunity to explore the hidden wonders beneath the ocean's surface. As you descend into the depths, you'll be greeted by a mesmerizing world.",
         "date":"2023-07-08T00:00:00Z",
         "image":"https://picsum.photos/id/3/200/300",
         "caption":"Underwater life",
         "price":90,
         "status":"onOffer",
         "author":3
      },
      {
         "id":4,
         "title":"Desert Survival Guide: Essential Tips for Thriving in Harsh Arid Environments",
         "subtitle":"Stay Alive: Learn the essential skills and techniques needed to survive in the desert. From finding water sources to building shelter.",
         "description":"Tips and tricks for surviving in the desert. The desert presents unique challenges, but with the right knowledge and preparation, you can navigate these harsh environments safely. ",
         "date":"2023-07-10T00:00:00Z",
         "image":"https://picsum.photos/id/4/200/300",
         "caption":"Desert landscape",
         "price":60,
         "status":"soulOut",
         "author":4
      },
      {
         "id":5,
         "title":"City Lights: Unveiling the Secrets of the Urban Jungle",
         "subtitle":"Urban Exploration: Discover the hidden gems and vibrant energy of the city as you embark on a journey through bustling streets.",
         "description":"Discover the hidden gems of the urban jungle. The city is a vibrant tapestry of culture, history, and innovation, offering countless opportunities for exploration and discovery. ",
         "date":"2023-07-12T00:00:00Z",
         "image":"https://picsum.photos/id/5/200/300",
         "caption":"City skyline",
         "price":75,
         "status":"onOffer",
         "author":5
      },
      {
         "id":6,
         "title":"Journey to the North: Embracing the Enchantment of the Arctic",
         "subtitle":"Exploring the Arctic: Experience the wonders of the Arctic region as you embark on a captivating journey through icy landscapes, majestic glaciers.",
         "description":"Experience the wonders of the Arctic region. The Arctic is a land of awe-inspiring beauty and captivating contrasts, where vast expanses of ice meet rugged mountains and serene fjords.",
         "date":"2023-07-14T00:00:00Z",
         "image":"https://picsum.photos/id/6/200/300",
         "caption":"Arctic adventure",
         "price":85,
         "status":"onSale",
         "author":6
      },
      {
         "id":7,
         "title":"Tropical Paradise: Escape to Your Own Slice of Blissful Serenity",
         "subtitle":"Relax and Unwind: Immerse yourself in the tranquil beauty of a tropical paradise, where crystal-clear waters, lush landscapes, and pristine beaches await.",
         "description":"Escape to a tropical paradise and relax. Picture yourself surrounded by swaying palm trees, gentle ocean breezes, and the soothing sound of waves lapping against the shore.",
         "date":"2023-07-16T00:00:00Z",
         "image":"https://picsum.photos/id/7/200/300",
         "caption":"Beach paradise",
         "price":95,
         "status":"soulOut",
         "author":7
      },
      {
         "id":8,
         "title":"Gardening 101: Cultivating Your Green Thumb for a Flourishing Oasis",
         "subtitle":"Grow Your Own: Embark on a journey into the world of gardening with practical tips and insights. Learn how to create your own thriving garden",
         "description":"Tips and tricks for starting your own garden. Gardening is a fulfilling and rewarding hobby that allows you to connect with nature and cultivate your own oasis of beauty and abundance.",
         "date":"2023-07-18T00:00:00Z",
         "image":"https://picsum.photos/id/8/200/300",
         "caption":"Gardening tools",
         "price":50,
         "status":"onOffer",
         "author":8
      },
      {
         "id":9,
         "title":"Photography Tips: Capturing Moments with Precision and Creativity",
         "subtitle":"Capture the Moment: Unleash your inner photographer with expert tips on mastering the art of capturing stunning images. Learn about composition.",
         "description":"Learn how to take stunning photographs. Photography is both an art and a science, and mastering it requires a keen eye for detail and a deep understanding of the elements that make a compelling image.",
         "date":"2023-07-20T00:00:00Z",
         "image":"https://picsum.photos/id/9/200/300",
         "caption":"Camera gear",
         "price":65,
         "status":"onSale",
         "author":9
      },
      {
         "id":10,
         "title":"Culinary Delights: Exploring the World of Flavors and Techniques with Passion",
         "subtitle":"Cooking with Love: Discover new recipes and cooking techniques that will inspire your culinary journey.",
         "description":"Discover new recipes and cooking techniques. The culinary world is a vast and exciting landscape filled with endless possibilities for creativity and exploration. ",
         "date":"2023-07-22T00:00:00Z",
         "image":"https://picsum.photos/id/10/200/300",
         "caption":"Delicious meal",
         "price":80,
         "status":"soulOut",
         "author":10
      }
   ],
   "comments":[
      {
         "id":101,
         "date":"2023-07-02T00:00:00Z",
         "body":"Amazing scenery!",
         "postId":1
      },
      {
         "id":102,
         "date":"2023-07-03T00:00:00Z",
         "body":"I want to visit!",
         "postId":1
      },
      {
         "id":103,
         "date":"2023-07-06T00:00:00Z",
         "body":"Mouth-watering!",
         "postId":2
      },
      {
         "id":104,
         "date":"2023-07-07T00:00:00Z",
         "body":"What's your secret?",
         "postId":2
      },
      {
         "id":105,
         "date":"2023-07-09T00:00:00Z",
         "body":"Breathtaking views!",
         "postId":3
      },
      {
         "id":106,
         "date":"2023-07-11T00:00:00Z",
         "body":"Essential reading!",
         "postId":4
      },
      {
         "id":107,
         "date":"2023-07-13T00:00:00Z",
         "body":"Love this city!",
         "postId":5
      },
      {
         "id":108,
         "date":"2023-07-15T00:00:00Z",
         "body":"Incredible journey!",
         "postId":6
      },
      {
         "id":109,
         "date":"2023-07-17T00:00:00Z",
         "body":"I want to go here!",
         "postId":7
      },
      {
         "id":110,
         "date":"2023-07-19T00:00:00Z",
         "body":"Great tips!",
         "postId":8
      }
   ],
   "authors":[
      {
         "id":1,
         "name":"John",
         "lastname":"Doe",
         "avatar":"https://i.pravatar.cc/150?img=1"
      },
      {
         "id":2,
         "name":"Jane",
         "lastname":"Smith",
         "avatar":"https://i.pravatar.cc/150?img=2"
      },
      {
         "id":3,
         "name":"Alice",
         "lastname":"Brown",
         "avatar":"https://i.pravatar.cc/150?img=3"
      },
      {
         "id":4,
         "name":"Bob",
         "lastname":"White",
         "avatar":"https://i.pravatar.cc/150?img=4"
      },
      {
         "id":5,
         "name":"Charlie",
         "lastname":"Green",
         "avatar":"https://i.pravatar.cc/150?img=5"
      },
      {
         "id":6,
         "name":"Dave",
         "lastname":"Black",
         "avatar":"https://i.pravatar.cc/150?img=6"
      },
      {
         "id":7,
         "name":"Eve",
         "lastname":"Johnson",
         "avatar":"https://i.pravatar.cc/150?img=7"
      },
      {
         "id":8,
         "name":"Frank",
         "lastname":"Brown",
         "avatar":"https://i.pravatar.cc/150?img=8"
      },
      {
         "id":9,
         "name":"Grace",
         "lastname":"Harris",
         "avatar":"https://i.pravatar.cc/150?img=9"
      },
      {
         "id":10,
         "name":"Henry",
         "lastname":"Wilson",
         "avatar":"https://i.pravatar.cc/150?img=10"
      }
   ]
}
